[{
  "_id": {
    "$oid": "6556da44b47d6ece88210808"
  },
  "source": "GSMArena.com",
  "author": "Michail",
  "title": "Samsung Galaxy Z Flip5 Retro announced - GSMArena.com news - GSMArena.com",
  "description": "The new limited edition Galaxy Z Flip5 pays homage to the legendary Samsung E700 from 2003. Samsung has rich history in the flip phone market and it is now...",
  "url": "https://www.gsmarena.com/samsung_galaxy_z_flip5_retro_announced-news-60395.php",
  "url_image": "https://fdn.gsmarena.com/imgroot/news/23/10/samsung-galaxy-z-flip5-retro-ofic/-952x498w6/gsmarena_00.jpg",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "Samsung has rich history in the flip phone market and it is now paying homage to one of its more influential models from two decades ago the Samsung E700 - with a limited edition Galaxy Z Flip5 Retro. Flip5 Retro features the same iconic indigo blue and silver colors as the E700 and comes with some nostalgic pixel graphics UI tweaks and cityscape animation on its Flex Window cover screen. Samsung ships the phone in a neat box with logos of both the Z Flip5 and the E700 as well as Flipsuit cards with stickers featuring the various Samsung logos from past eras. The package also includes a Samsung E700 collector card engraved with a unique serial number. The Galaxy Z Flip5 Retro will be available in limited quantities in South Korea from November 1 as well as in the UK, France, Germany, Spain and Australia from November 2. Consumers in these markets can purchase the limited edition device exclusively through Samsung's official website. Pricing details were not provided yet."
},
{
  "_id": {
    "$oid": "6556da44b47d6ece88210809"
  },
  "source": "Nintendo Life",
  "author": "Liam Doolan",
  "title": "Newly Discovered Nintendo Filing Shows Off \"Dual-Screen, Detachable Device\" - Nintendo Life",
  "description": "Sending Switch successor rumours into overdrive (again)",
  "url": "https://www.nintendolife.com/news/2023/10/newly-discovered-nintendo-filing-shows-off-dual-screen-detachable-device",
  "url_image": "https://images.nintendolife.com/2c2ae31a1af9d/1280x720.jpg",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "Switch successor rumours have got louder in recent months and now some new Nintendo filings have been discovered. New ideas and designs from Nintendo, which were originally filed by the Japanese video game company on 11th November 2022, have been discovered on the 'World Intellectual Property Organization' website. They've just been shared publically earlier this week on 26th October 2023 and while it's probably best to temper your expectations, the one filing that's sent some Nintendo fans into an instant frenzy is a \"dual-screen, detachable device\" that kind of resembles a 3DS."
},
{
  "_id": {
    "$oid": "6556da44b47d6ece8821080a"
  },
  "source": "Dexerto",
  "author": "Philip Trahan",
  "title": "Super Mario Bros. Wonder: All Wonder Tokens in Search Party – Puzzling Park - Dexerto",
  "description": "Super Mario Bros. Wonder's Search Party Puzzling Park course tasks players with finding hidden Wonder Tokens to finish the level.",
  "url": "https://www.dexerto.com/gaming/super-mario-bros-wonder-all-wonder-tokens-in-search-party-puzzling-park-2358384/",
  "url_image": "https://editors.dexerto.com/wp-content/uploads/2023/10/29/super-mario-wonder-search-party-header.jpg",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "Super Mario Bros. Wonder’s Search Party Puzzling Park course tasks players with finding hidden Wonder Tokens to finish the level. Here’s how you can find all the hidden Wonder Tokens in W2’s Puzzling Park. Super Mario Bros. Wonder has a variety of different courses that players can tackle to unlock new paths or collect Wonder Seeds. While courses like the various Badge Challenges and races test players’ platforming skills, Search Party courses task fans with finding hidden Wonder Tokens throughout the level to complete the course. The first Search Party level, called Puzzling Park, is located in World 2 – Fluff-Puff Peaks and is actually quite tricky to complete alone. Thankfully, this handy guide will help solo players locate every hidden Wonder Token in Puzzling Park so you can move on."
},
{
  "_id": {
    "$oid": "6556da44b47d6ece8821080b"
  },
  "source": "Windows Central",
  "author": "Jennifer Young, Jez Corden",
  "title": "Xbox's new policy — say goodbye to unofficial accessories from November thanks to error '0x82d60002' - Windows Central",
  "description": "Error 0x82d60002 informs players their devices will be blocked",
  "url": "https://www.windowscentral.com/gaming/xbox/xboxs-new-policy-say-goodbye-to-unofficial-accessories-after-november",
  "url_image": "https://cdn.mos.cms.futurecdn.net/oxMY6AeCKRV3vxtRYyhHBG-1200-80.jpg",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "What you need to know From November 12, 2023, Microsoft will no longer allow unauthorized third-party accessories to be used with its Xbox consoles. Players are reporting a warning message displaying on Xbox when plugging in unauthorized accessories, notifying them of the date their accessories will be blocked with \"error 0x82d60002.\" Xbox advises returning the accessory and instead referring to its list of authorized products on its website. The message is shown due to the latest console build, which is said to be causing console issues when using these third-party accessories. UPDATE (October 29, 2023): We've heard from sources familiar with Microsoft's plans that this may be related to Microsoft expanding its program for approved third-party wireless Xbox controllers. Most Xbox third-party controllers right now are wired. UPDATE (October 30, 2023): Microsoft has responded to our questions for clarification around this new policy."
},
{
  "_id": {
    "$oid": "6556da44b47d6ece8821080c"
  },
  "source": "My Nintendo News",
  "author": "ssf1991",
  "title": "Rumor: Industry analyst Serkan Toto apparently hinting a Zelda remake by end of the year - My Nintendo News",
  "description": "With Nintendo's final Direct of the year now just a memory, Nintendo's first-party release schedule is now set in stone for the rest of 2023. However, there is a recent rumor going around suggesting…",
  "url": "https://mynintendonews.com/2023/10/29/rumor-industry-analyst-serkan-toto-apparently-hinting-a-zelda-remake-by-end-of-the-year/",
  "url_image": "https://i0.wp.com/mynintendonews.com/wp-content/uploads/2023/10/zelda_shield_sword.jpg?fit=2048%2C2048&ssl=1",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "With Nintendo’s final Direct of the year now just a memory, Nintendo’s first-party release schedule is now set in stone for the rest of 2023. However, there is a recent rumor going around suggesting that Nintendo may have one more surprise in store for fans before 2024 arrives in a couple of months. You see, industry analyst Serkan Toto has posted a cryptic tweet on his Twitter account. The tweet is apparently hinting at a Legend of Zelda remake coming by the end of the year. This would be the second time Toto hinted at a Zelda release. The first time was in 2021, where he hinted at a 2022 release for The Legend of Zelda: Tears of The Kingdom. This was proven true in the Direct that followed, but the game would be delayed to 2023 later on. As for what the remake is, there have still been rumors at Nintendo Switch ports of the HD remakes of Twilight Princess and Wind Waker. Whatever it is, if Toto is right, then it’s likely that a reveal will be coming via social media or at The Game Awards in December. Nevertheless, you can see his tweet down below."
},
{
  "_id": {
    "$oid": "6556da44b47d6ece8821080d"
  },
  "source": "Dexerto",
  "author": "Philip Trahan",
  "title": "Pokemon Go: All Ultra Beasts & how to catch them - Dexerto",
  "description": "Ultra Beasts were introduced to Pokemon in Gen 7 and have made their way to Pokemon Go. Here's how to catch all of them.",
  "url": "https://www.dexerto.com/pokemon/pokemon-go-all-ultra-beasts-how-to-catch-them-2358311/",
  "url_image": "https://editors.dexerto.com/wp-content/uploads/2023/10/29/pokemon-go-ultra-beasts.jpg",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "Ultra Beasts are a group of extradimensional creatures introduced to Pokemon in the Generation 7 games and have made their way to Pokemon Go. Here’s a breakdown of all the available Ultra Beasts in Pokemon Go and how to catch them. Ultra Beasts were introduced to Pokemon Go during the 2022 Go Fest event, with multiple different Ultra Beasts added as part of Special Research quests or as 5-Star Raid encounters. Outside of Pokemon Go, these odd, alien-like Pokemon were introduced in the mainline series of games in the Alola region and have not really made a return in the main series since. While they are considered their own category of Pokemon, they are not all that different than standard Legendary Pokemon from other Generations."
},
{
  "_id": {
    "$oid": "6556da44b47d6ece8821080e"
  },
  "source": "Oneesports.gg",
  "author": "Dexter Tan Guan Hao",
  "title": "Ringmaster Dota 2: Bring the circus to town with newest hero - ONE Esports",
  "description": "Come one, come all, for the greatest show on earth — not The International 2023 grand finals, but the reveal of Ringmaster.",
  "url": "https://www.oneesports.gg/dota2/ringmaster-dota-2-newest-hero/",
  "url_image": "https://cdn.oneesports.gg/cdn-data/2023/10/Dota2_Ringmaster.jpg",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "Jump through the hoops or else. Come one, come all, for the greatest show on earth — not The International 2023 grand finals, but the reveal of its dastardly new hero. The Ringmaster will be the MOBA’s latest hero, following the release of Muerta. In a trailer dropped after the lower bracket final of TI12, we get to see our first glimpse of the head of the circus — and start speculating on just what novel madness he might bring to the game. The Ringmaster doesn’t exactly make an appearance. Instead, he’s playing the long game with Axe — leading the strength hero on with a mechanical Kobold Foremani towards a carnival game-like contraption. The machine unfolds into a personal strength tester for Axe, filled with various artistic depictions of Mogul Khan, tricking the strength hero into testing his might — and falling into a gnarly trap in the process, getting grabbed by mechanical arms that spawn from inside the gadget."
},
{
  "_id": {
    "$oid": "6556da44b47d6ece8821080f"
  },
  "source": {
    "id": "engadget",
    "name": "Engadget"
  },
  "author": "Cheyenne MacDonald",
  "title": "New report reveals details on the three M3 chips Apple may launch Monday night - Engadget",
  "description": "Apple will launch its M3, M3 Pro and M3 Max chips at the \"Scary Fast\" event, Bloomberg's Mark Gurman reported in the Power On newsletter. Gurman shared some ...",
  "url": "https://www.engadget.com/new-report-reveals-details-on-the-three-m3-chips-apple-may-launch-monday-night-202456989.html",
  "url_image": "https://s.yimg.com/ny/api/res/1.2/bi.cXpLfbMbmhCgqwhi93Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2023-10/16661740-7698-11ee-ace7-fbd528f8b1b0",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "Apple is planning to debut three M3 chips at its “Scary Fast” Mac event Monday night, according to Bloomberg’s Mark Gurman — the M3, M3 Pro and M3 Max. The event is set to kick off at 8 PM ET and is expected to bring multiple hardware announcements. Gurman previously reported that the company is prepping a new 24-inch iMac which could make an appearance tomorrow, along with upgraded MacBook Pros running the new M3 series. In the Power On newsletter, Gurman writes that the standard M3 chip is likely to sport an eight-core CPU and 10-core GPU like the M2, but with improvements to performance speed and memory. He also notes the company is testing multiple configurations for both the M3 Pro and M3 Max chips. We may see an M3 Pro with 12-core CPU/18-core GPU and the option for a pricier 14-core CPU with a 20-core GPU. Meanwhile, the M3 Max could come with 16 CPU cores and either 32 or 40 GPU cores. We won’t know anything for sure until Apple's unusually-timed October event starts tomorrow night. Thankfully, that’s not a long time to wait. Join us here to watch as it all unfolds."
},
{
  "_id": {
    "$oid": "6556da44b47d6ece88210810"
  },
  "source": "TweakTown",
  "author": "Derek Strickland",
  "title": "Tencent, Sony, Take-Two and Savvy Games Group expected to make gaming acquisitions in 2024 - TweakTown",
  "description": "Some of gaming's top video games companies are expected to double-down on acquisitions throughout 2024, including Tencent, Sony, and Take-Two Interactive.",
  "url": "https://www.tweaktown.com/news/94056/tencent-sony-take-two-and-savvy-games-group-expected-to-make-gaming-acquisitions-in-2024/index.html",
  "url_image": "https://static.tweaktown.com/news/9/4/94056_3233_tencent-sony-take-two-and-savvy-games-group-expected-to-make-gaming-acquisitions-in-2024_full.png",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "Video game acquisitions and buyouts will continue in 2024 as some of the biggest names plan to execute expansion efforts, investment firm Drake Star predicts. This year, Microsoft made history by purchasing Activision-Blizzard for a record-breaking $68.7 billion. This combination was the biggest acquisition in the history of the video games industry, a segment that is poised to make over $180 billion in 2023. Multiple years of strategic investments and buyouts led to the Activision merger and the current availability of independent third-party publishers continues to dwindle. According to investment bank Drake Star, this era of consolidation isn't over. M&A will continue throughout 2024 and big players like the $30 billion revenue Tencent, $26 billion Sony Interactive Entertainment, Saudi Arabia's Savvy Games Group, and the recently-merged Take-Two Interactive are expected to make buyouts. \"Based on our discussions with many of the top gaming companies in the last weeks, we expect the deal volume to increase steadily over the next year,\" Drake Star's Michael Metzger told Axios."
},
{
  "_id": {
    "$oid": "6556da44b47d6ece88210811"
  },
  "source": "Wccftech",
  "author": "Alessio Palumbo",
  "title": "Here’s Why Harebrained Schemes Should Be Microsoft’s Next Acquisition - Wccftech",
  "description": "With Harebrained Schemes now independent once again, there are several reasons that make it Microsoft's next ideal acquisition target.",
  "url": "https://wccftech.com/heres-why-harebrained-schemes-should-be-microsofts-next-acquisition/",
  "url_image": "https://cdn.wccftech.com/wp-content/uploads/2023/10/Collage-Maker-29-Oct-2023-06-21-PM-3801-scaled.jpg",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "With the official closure of the acquisition of Activision Blizzard finally in the rearview, it is time to look to Microsoft's next likely target in the industry. As it happens, a nice and tidy opportunity just opened up when, following the disappointing launch of the new IP The Lamplighters League, Harebrained Schemes announced that it would separate from Paradox Interactive to seek new investments and partnerships. There are several reasons why the studio, founded in 2011 by Jordan Weisman (who's now busy with Adventure Forge) and Mitch Gitelman, might be an ideal target for Microsoft's next acquisition. First of all, let's go through why the Xbox company needs yet another studio. As mentioned above, they just acquired Activision Blizzard. However, that does not mean they're done with acquisitions, not by a long shot. Microsoft began the massive acquisition spree that led them to acquire Ninja Theory, Undead Labs, Compulsion Games, Playground Games, inXile Entertainment, Obsidian Entertainment, Double Fine Productions, plus all of ZeniMax and ABK in the span of five years because it finally understood that content is king, especially for its Game Pass subscription service."
},
{
  "_id": {
    "$oid": "6556da44b47d6ece88210812"
  },
  "source": "Fox News",
  "author": "The Kim Komando Show",
  "title": "Everyday tech hacks: from phone shortcuts to webcam magic - Fox News",
  "description": "Using a webcam has been a technology out and well-loved for a long time, learn how to use one of your favorite tech tools to enhance your productivity.",
  "url": "https://www.foxnews.com/tech/everyday-tech-hacks-from-phone-shortcuts-webcam-magic",
  "url_image": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/1-CONFUSED-LOOKING-AT-PHONE.jpg",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "You don't know what you don't know. Sounds obvious, but when it comes to tech, that means you might be missing out on features that youd love if only you knew about them. Take the hidden apps on your phone. I don’t know why developers don’t talk about these more. SMART TECH LIFE HACKS TO SAVE YOU TIME AND KEEP YOU SAFE I make it my mission to tell you about all those little time-savers, productivity helpers and annoyance stoppers built into your everyday devices. Here are three I bet you’ll use again and again."
},
{
  "_id": {
    "$oid": "6556da44b47d6ece88210813"
  },
  "source": "PCGamesN",
  "author": "Ken Allsop",
  "title": "Baldur's Gate 3's most essential tool gets a much-needed upgrade - PCGamesN",
  "description": "A Baldur’s Gate 3 better context menu mod overhauls the RPG’s contextual interface, adding icons for easier use and improving readability.",
  "url": "https://www.pcgamesn.com/baldurs-gate-3/mod-better-context-menu",
  "url_image": "https://www.pcgamesn.com/wp-content/sites/pcgamesn/2023/10/baldurs-gate-3-better-context-menu-mod-caites-larian-studios-dnd-rpg-bg3.jpg",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "The Baldur’s Gate 3 menus are pretty good for the most part, but with so many options at your fingertips with every turn and each roll of the dice, it can be easy to get a little overwhelmed. Fortunately, help is at hand courtesy of a new Baldur’s Gate 3 mod that will slot nicely into any rotation, giving your contextual menu a welcome spruce up, and helping you navigate it more quickly as a nice little bonus. If you’re still playing Larian Studio’s Dungeons and Dragons epic, you’ll definitely want to snag this handy addition. This Baldur’s Gate 3 better context menu mod comes from creator ‘Caites,’ who has put together several of the most useful user interface tweaks we’ve seen for the RPG game. It reworks one of the most used menus in the game – the context menu that appears when you right-click on basically any object or character. It’s a simple but slick overhaul that fast earns its place among the best Baldur’s Gate 3 mods."
},
{
  "_id": {
    "$oid": "6556da44b47d6ece88210814"
  },
  "source": "Tom's Guide",
  "author": "Alyse Stanley",
  "title": "Walmart early Black Friday sales live — 7 deals I would buy - Tom's Guide",
  "description": "These are the best early deals on Apple smartwatches, laptops, headphones and more",
  "url": "https://www.tomsguide.com/deals/walmart-early-black-friday-sales-live-7-deals-i-would-buy",
  "url_image": "https://cdn.mos.cms.futurecdn.net/kkSHveCUire9qJpyWTWjt9-1200-80.jpg",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "Somehow we're already fast approaching November (who let that happen?), and that means retailers are chomping at the bit to offer the best early Black Friday deals. That's right, the first Walmart Black Friday deals are already here, and the retailer is kicking off the holiday season with savings on Apple products, headphones, laptops, and more. Walmart's offering sitewide rollbacks on Xmas decorations, Crocs, and home appliances. On top of that, you can snag some steep discounts on Apple gear, headphones, TVs, and more. And of course, be sure to check our guide to the best Walmart promo codes if you're looking for more ways to save big this week. "
},
{
  "_id": {
    "$oid": "6556da44b47d6ece88210815"
  },
  "source": "Dexerto",
  "author": "James Lynch",
  "title": "Pokemon Go players blast “garbage” forced local Raids - Dexerto",
  "description": "The Shadow Lugia Raid has caused a lot of frustration and the community has gathered to criticize local Raids in Pokemon Go.",
  "url": "https://www.dexerto.com/pokemon/pokemon-go-players-blast-garbage-forced-local-raids-2358152/",
  "url_image": "https://editors.dexerto.com/wp-content/uploads/2023/10/29/ezgif.com-webp-to-jpg-16.v1-1.jpg",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "The Pokemon Go community has taken to social media to criticize local Raids that offer little in guaranteed returns for their efforts. Raids represent some of the most challenging encounters in the game and usually require a group of around five or more to complete successfully on the highest difficulties. They are particularly desirable for players due to their helpful item rewards and the chance to catch the raid Pokemon after victory. As things stand, some Raids can be attended remotely, but others require players to be local to the Raid location to participate. This has proved to be controversial among members of the community, and many would like to see local Raids changed."
},
{
  "_id": {
    "$oid": "6556da44b47d6ece88210816"
  },
  "source": "9to5Toys",
  "author": "Rikka Altland",
  "title": "Here’s our first look at LEGO’s upcoming 4,000-piece Natural History Museum - 9to5Toys",
  "description": "The new LEGO Natural History Museum will debut next year as the 2024 Modular Building and set number 10326.",
  "url": "https://9to5toys.com/2023/10/29/lego-natural-history-museum-box-leak/",
  "url_image": "https://i0.wp.com/9to5toys.com/wp-content/uploads/sites/5/2023/10/LEGO-Natural-History-Museum-reveal.png?resize=1200%2C628&ssl=1",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "We finally have a first look at the upcoming LEGO Natural History Museum. Next year’s Modular Building will be bringing a bit of a scientific vibe to the series with an over 4,000-piece build when it debuts on January 1, 2024 as LEGO set number 10326. Stay up-to-date on the latest news, and give our LEGO account over on X (Twitter) a follow, as well as our Threads, Mastodon, BlueSky, Instagram, and TikTok. You can, of course, always bookmark our guide right here or sign up for our newsletter. You can also support 9to5Toys by purchasing LEGO from our affiliate links for the LEGO Shop, Amazon, and Zavvi. Back at the start of the month, 9to5Toys was able to report on what the next addition to the LEGO Modular Building series would be. Now we have a first look, with the box art for the upcoming creation leaking ahead of next year’s debut."
},
{
  "_id": {
    "$oid": "6556da44b47d6ece88210817"
  },
  "source": "9to5google.com",
  "author": "Ben Schoon",
  "title": "Why does Google Tensor exist if Snapdragon is better at AI? - 9to5Google",
  "description": "Qualcomm's new Snapdragon 8 Gen 3 puts out an impressive show with AI, but that demands the question of why Google Tensor exists.",
  "url": "https://9to5google.com/2023/10/29/snapdragon-8-gen-3-google-tensor-ai/",
  "url_image": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2023/10/google-ai-wallpapers-offline.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
  "published_at": {
    "$date": "2023-11-17T06:46:45.431Z"
  },
  "content": "Google Tensor has always pitched itself on AI, and when it launched in 2021, it blew away the competition. But, now, the Snapdragon 8 Gen 3 is showing off truly incredible on-device AI capabilities, and it really demands the question of if Google Tensor should still exist. In the Pixel 6 series, Google Tensor made its debut and, as we explained at the time, it was all about bringing “AI breakthroughs directly to Pixel.” And that’s absolutely something the chip did. Since the first Tensor chip, we’ve seen Google really double down on AI features for Pixel phones, especially with Tensor G3 and the Pixel 8 series. However, all of those AI features came under fire since the Pixel 8’s launch as some have been noting that most of the AI features that Google touted with the Pixel 8 don’t actually run on device. Magic Editor, AI wallpapers, and others all depend on an internet connection, with the former offloading the job to the cloud as it requires a full backup of the photo to Google Photos."
}]